---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesNotIntersect
source: html/cbd05a02-40cb-de56-ddfa-072f7ff1a4ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesNotIntersect Property

Can't project Analytical Model. Planes do not intersect each other.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProjectionPlanesNotIntersect { get; }
```